package main.java.core.level02.task19;

/**
 * Вы хотите вывести цитату героя, который сказал: "Поехали!".
 * Создайте переменную типа String с именем heroQuote. Присвойте ей это значение, используя экранирование кавычек, и выведите heroQuote на экран.
 * Требования:
 * •	В программе должна быть объявлена переменная типа String с именем heroQuote.
 * •	Переменной heroQuote должно быть присвоено значение "Поехали!", при этом двойные кавычки внутри строки должны быть экранированы.
 * •	На экран должно быть выведено значение переменной heroQuote с помощью System.out.println.
 */
public class Task19 {
    public static void main(String[] args) {

        String heroQuote = "\"Поехали!\"";
        System.out.println(heroQuote);
    }

}
