package main.java.core.level01.task01;

/**
 * Напишите программу на Java, которая выводит на экран фразу: "Круто быть программистом!😎"
 * Требования:
 * •	Программа должна выводить на экран фразу: Круто быть программистом!😎
 * •	Для вывода текста должно использоваться выражение System.out.println.
 */
public class Task01 {
    public static void main(String[] args) {
        System.out.println("Круто быть программистом!\uD83D\uDE0E");

    }
}