package main.java.core.level01.task02;

/**
 * Представьте, что вы отправляете сообщение в чат. Напишите программу, которая выводит на экран текущий год — 2025 — и смайлик 😅. Каждое сообщение должно быть на отдельной строке.
 *
 * Требования:
 * •	Программа должна вывести на экран число 2025.
 * •	Программа должна вывести на экран смайлик 😅.
 * •	Число 2025 и смайлик 😅 должны выводиться на отдельных строках, а не в одной строке.
 * •	Для вывода сообщений на экран необходимо использовать команду System.out.println.
 */
public class Task02 {
    public static void main(String[] args) {
        System.out.println("2025");
        System.out.println("\uD83D\uDE05");
    }
}
